backend-api/app/Controllers/Barang.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
---
    public function index()
    {
        $model = new BarangModel();
        // Mengambil data barang sekaligus nama kategorinya menggunakan query builder
        $data = $model->select('barang.*, kategori.nama_kategori')
                      ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
                      ->findAll();