backend-api/app/Controllers/Histori.php

    public function index()
    {
        // Join tabel histori dengan tabel barang agar nama barang muncul
        $db = \Config\Database::connect();
        $builder = $db->table('histori_transaksi');
        $builder->select('histori_transaksi.*, barang.nama_barang');
        $builder->join('barang', 'barang.id = histori_transaksi.barang_id', 'left');
        $builder->orderBy('histori_transaksi.tanggal', 'DESC');

        $data = $builder->get()->getResult();
---
SELECT `histori_transaksi`.*, `barang`.`nama_barang`
FROM `histori_transaksi`
LEFT JOIN `barang` ON `barang`.`id` = `histori_transaksi`.`barang_id`
ORDER BY `histori_transaksi`.`tanggal` DESC