backend-api/app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $model = new KategoriModel();
        $data = $model->findAll();